import numpy as np
# A = np.array([[5,-1,3,1,2], [-2,8,5,-1,1]])
# x = np.array([1,2,3,4,5])
# print(A)
# print(x)
# print(x@A.T)
# A=np.array( [ [1,9,8,5] , [3,6,3,2] , [3,3,3,3], [0,2,5,9], [4,4,1,2] ] )
# B=np.array( [ [1,-1,0,1,1] , [-2,0,2,-1,1] ] )
# print(B@A)
# x = np.array([1,2,1,0,4])
# y = np.array([2,1,-1,1,0])
# z = np.array([-1,1,-1,0,0])
# A=np.array([x,y,z])
# print(A@A.T)
import pandas as pd
Count_DF = pd.DataFrame({'Женские стрижки': [10, 2, 12, 4, 6, 10, 22, 7], 
                                'Мужские стрижки': [5, 21, 12, 8, 25, 3, 1, 0], 
                                'Окрашивания':[12, 3, 0, 18, 27, 2, 4, 31],
                              'Укладка':[15, 25, 30, 14, 25, 17, 25, 31],
                                'Уход':[10, 6, 4, 5, 18, 12, 20, 28]
                                }, 
                               index=['Аня', 'Борис', 'Вика', 'Галя', 'Дима', 'Егор', 'Женя','Юра'])
Price_DF = pd.DataFrame({'Женские стрижки': [2, 1.8, 2, 1.8, 2.5, 5, 1.1, 4.5], 
                                'Мужские стрижки': [1.5, 2.5, 2, 1.2, 3.5, 5, 1, 4], 
                                'Окрашивания':[1, 1, 0, 2.8, 2, 3, 1.5, 2.5],
                              'Укладка':[0.8, 1, 0.5, 0.8, 1, 2, 0.5, 1],
                                'Уход':[1, 1, 2, 2, 1.5, 2.5, 1.7, 2] 
                                }, 
                               index=['Аня', 'Борис', 'Вика', 'Галя', 'Дима', 'Егор', 'Женя','Юра'])

A=Count_DF.values
B=Price_DF.values
# print(A)                               
# print(A)                               
# print(A[1,:]*B[1,:])                               
# print(str(list(A[1,:]*B[1,:])).replace(' ' ,''))
C = np.array([0.2, 0.2, 0.3, 0.1, 0.1])
print(C)
E=np.ones((1,5))[0]
print(E)
print(str(list(A*B@C)).replace(' ' ,''))
print(str(list(A*B@E)).replace(' ' ,''))
print(str(list(A*B@E - A*B@C)).replace(' ' ,''))

